……………..Write  By  Lijiaze  Under  Huangjianhao  Instruction……………
1.解压GO的压缩包，然后将解压后的GO文件放到自己想存放的盘里面。同时在这盘里新建一个文件夹dev。在dev里面再新建一个go文件夹，而go文件夹里面也新建三个文件夹src,pkg,bin。（比如我的是存放在E盘。如下图。） 
 
 
2.修改环境变量，打开我的电脑（计算机），右键选择属性，打开高级系统设置。
 



3.点击打开环境变量。
 
4.点击新建。一个GOPATH，一个GOROOT以及修改PATH的值。
 
 
 

 
注：这里的变量值取值是这样来的，就是存放GO文件的地址。我这里是放在E盘，使用使用E:\再加具体的地址。至此，安装已经完成。此时可以打开cmd，输入go然后界面出现如下内容表面安装已成功。
 

下面编译个简单的例子。
1.在rtool上下载一个文本工具Notepad++，安装完成后打开，新建一个文档，如下：
 
新建，然后输入程序，然后保存，保存时要以main.go名字保存，并且要保存在我们新建的dev这个文件夹目录下src的文件夹内。
 
2.打开cmd，这时要注意了，go安装在那里这时就会有所区别，像我的是安装在e盘，所以我要进入bin的目录编译时就要输入cd/d e:\dev\go\bin。如下：
 
然后输入go install hello 此时若程序不出现问题则会出现如下的界面：
 
中间没有出现错误提醒，要是程序有问题则会有错误的提醒。
然后输入hello，此时便实现了我们第一个go语言的编程项目hello，world了！
 



